In [36]:
import pandas as pd
import numpy as np

In [37]:
from pandas import Series, DataFrame

In [38]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [39]:
obj.values

array([ 4,  7, -5,  3])

In [40]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [41]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [42]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [43]:
obj2['a']

-5

In [44]:
obj2['d'] = 6

In [45]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [46]:
obj2[obj2 > 3]

d    6
b    7
dtype: int64

In [47]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [48]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [49]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [50]:
'b' in obj2

True

In [51]:
'e' in obj2

False

In [52]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000,'Utah': 5000}

In [53]:
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [54]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [55]:
obj4 = pd.Series(sdata, index=states)

In [56]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [57]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [58]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [59]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [60]:
obj4.notnull()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [61]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [62]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [63]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [64]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada',
'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [65]:
frame = pd.DataFrame(data)

In [66]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [67]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [68]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [69]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'], 
                      index=['one', 'two', 'three', 'four', 'five', 'six'])

In [70]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [71]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [72]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

#### 笔记:IPython 提供了类似属性的访问(即 frame2.year)和 tab 补全。 frame2[column]适用于任何列的名，但是 frame2.column 只有在列名是一个合 理的 Python 变量名时才适用。
#### 注意，返回的 Series 拥有原 DataFrame 相同的索引，且其 name 属性也已经被 相应地设置好了。

In [73]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

#### 列可以通过赋值的方式进行修改。例如，我们可以给那个空的"debt"列赋上一 个标量值或一组值:

In [74]:
frame2['debt'] = 16.5

In [75]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [76]:
frame2['debt'] = np.arange(6.)

In [77]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [78]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [79]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [80]:
frame2['eastern'] = frame2.state == 'Ohio'

In [81]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   0.0     True
two    2001    Ohio  1.7   1.0     True
three  2002    Ohio  3.6   2.0     True
four   2001  Nevada  2.4   3.0    False
five   2002  Nevada  2.9   4.0    False
six    2003  Nevada  3.2   5.0    False

In [82]:
del frame2['eastern']

In [83]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [84]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [85]:
frame3 = pd.DataFrame(pop)

In [86]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [87]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [88]:
type(pop)

dict

In [89]:
#给index赋值的时候要么是index对象，要么是series对象，也可以加入columns
pd.DataFrame(pop,columns=['Nevada', 'Ohio'],index=[2001,2002,2003])
pd.DataFrame(pop,index=pd.Series([2001,2002,2003]))

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [90]:
pdata = {'Ohio': frame3['Ohio'][:-1], 'Nevada': frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [91]:
frame3.index.name = 'year'; frame3.columns.name = 'state'

In [92]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [93]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [94]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])

In [95]:
 index=obj.index

In [96]:
index

Index(['a', 'b', 'c'], dtype='object')

In [97]:
index[1:]

Index(['b', 'c'], dtype='object')

In [98]:
labels = pd.Index(np.arange(3))

In [99]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [100]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)

In [101]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [102]:
obj2.index is labels

True

In [103]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [104]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [105]:
"Ohio" in frame3.columns

True

In [106]:
2003 in frame3.index

False

In [107]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])

In [108]:
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [109]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [110]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [111]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [112]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [113]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [114]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [115]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [116]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['a', 'c', 'd'],columns=['Ohio', 'Texas',
'California'])

In [117]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [118]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

In [119]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [120]:
states = ['Texas', 'Utah', 'California']

In [121]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [122]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])

In [123]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [124]:
new_obj = obj.drop('c')

In [125]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [126]:
 obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [127]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [128]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [129]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [130]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [131]:
obj['b':'c'] = 5

In [132]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [133]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'NewYork'],
                    columns=['one', 'two', 'three','four'])

In [134]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
NewYork    12   13     14    15

In [135]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [136]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [137]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [138]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    4    5
Utah        11    8    9

In [139]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    4    5      6
Utah        8    9     10
NewYork    12   13     14

笔记:在一开始设计 pandas 时，我觉得用 frame[:, col]选取列过于繁琐(也 容易出错)，因为列的选择是非常常见的操作。我做了些取舍，将花式索引的 功能(标签和整数)放到了 ix 运算符中。在实践中，这会导致许多边缘情况， 数据的轴标签是整数，所以 pandas 团队决定创造 loc 和 iloc 运算符分别处理 严格基于标签和整数的索引。
ix 运算符仍然可用，但并不推荐。

In [140]:
ser = pd.Series(np.arange(3.))

In [141]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [142]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])

In [143]:
ser2[-1]

2.0

In [144]:
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [145]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)),
columns=list('bcd'), index=['Ohio', 'Texas', 'Colorado'])

In [146]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)),
columns=list('bde'), index=['Utah', 'Ohio', 'Texas','Oregon'])

In [147]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [148]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [149]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [150]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),columns=list('abcd'))

In [151]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))

In [152]:
df2.loc[1, 'b'] = np.nan

In [153]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [154]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [155]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [156]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [157]:
1 / df1

          a         b         c         d
0       inf  1.000000  0.500000  0.333333
1  0.250000  0.200000  0.166667  0.142857
2  0.125000  0.111111  0.100000  0.090909

In [158]:
df1.rdiv(1)

          a         b         c         d
0       inf  1.000000  0.500000  0.333333
1  0.250000  0.200000  0.166667  0.142857
2  0.125000  0.111111  0.100000  0.090909

表 5-5 列出了 Series 和 DataFrame 的算术方法。它们每个都有一个副本，以字 母 r 开头，它会翻转参数。因此这两个语句是等价的:

In [159]:
frame = pd.DataFrame(np.random.randn(4, 3),
columns=list('bde'), index=['Utah', 'Ohio', 'Texas',
'Oregon'])

In [160]:
frame

               b         d         e
Utah   -0.458766 -0.229531  1.133829
Ohio    0.432999 -2.546221 -0.519341
Texas   0.326550 -0.495374 -1.195023
Oregon  1.954344 -0.363619 -0.267319

In [161]:
np.abs(frame)

               b         d         e
Utah    0.458766  0.229531  1.133829
Ohio    0.432999  2.546221  0.519341
Texas   0.326550  0.495374  1.195023
Oregon  1.954344  0.363619  0.267319

In [162]:
f = lambda x: x.max() - x.min()

In [163]:
frame.apply(f)

b    2.413110
d    2.316690
e    2.328852
dtype: float64

In [164]:
frame.apply(f, axis='columns')

Utah      1.592595
Ohio      2.979220
Texas     1.521573
Oregon    2.317964
dtype: float64

In [165]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min','max'])

In [166]:
frame.apply(f)

            b         d         e
min -0.458766 -2.546221 -1.195023
max  1.954344 -0.229531  1.133829

In [167]:
format = lambda x: '%.2f' % x

In [168]:
frame.applymap(format)

            b      d      e
Utah    -0.46  -0.23   1.13
Ohio     0.43  -2.55  -0.52
Texas    0.33  -0.50  -1.20
Oregon   1.95  -0.36  -0.27

In [169]:
frame['e'].map(format)

Utah       1.13
Ohio      -0.52
Texas     -1.20
Oregon    -0.27
Name: e, dtype: object

In [170]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])

In [171]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [172]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'], columns=['d', 'a', 'b', 'c'])

In [173]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [174]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [175]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [176]:
frame1 = pd.DataFrame(np.arange(2,10).reshape((2, 4)),
                     index=['three', 'one'], columns=['d', 'a', 'b', 'c'])

In [177]:
frame1

       d  a  b  c
three  2  3  4  5
one    6  7  8  9

In [178]:
frame1.sort_index(axis=1)

       a  b  c  d
three  3  4  5  2
one    7  8  9  6

In [179]:
obj = pd.Series([4, 7, -3, 2])

In [180]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [181]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])

In [182]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [183]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0,1]})

In [184]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [185]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [186]:
frame.sort_values(by='a')

   b  a
0  4  0
2 -3  0
1  7  1
3  2  1

In [187]:
frame.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [188]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])

In [189]:
obj.rank()#-5排名第一，位置在1，0排名第二，位置在5，2排名第三，位置在4
#两个4排名4、5，平均排名4.5，两个7排名6、7，平均排名6.5

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [190]:
 obj.rank(method='first')#也可以根据值在原数据中出现的顺序给出排名

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [191]:
# Assign tie values the maximum rank in the group
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [192]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [193]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [194]:
obj.index.is_unique#判断索引值是否唯一

False

In [195]:
obj['a']

a    0
a    1
dtype: int64

In [196]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]],
index=['a', 'b', 'c', 'd'],columns=['one', 'two'])

In [197]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [198]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [199]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [200]:
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [201]:
df.idxmax()

one    b
two    d
dtype: object

In [202]:
df.cumsum()#累计求和

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [203]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [204]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)

In [205]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [206]:
import pandas_datareader.data as web

In [207]:
import pandas_datareader.data as web
all_data = {ticker: web.get_data_yahoo(ticker)
            for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}
price = pd.DataFrame({ticker: data['Adj Close']
                     for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume']
for ticker, data in all_data.items()})

In [208]:
returns = price.pct_change()

In [209]:
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2019-06-20  0.008036  0.012912  0.009286  0.008246
2019-06-21 -0.003409  0.002521  0.000146  0.009411
2019-06-24 -0.001006  0.001078  0.005914 -0.005669
2019-06-25 -0.015158 -0.007104 -0.031572 -0.026149
2019-06-26  0.022728  0.002168  0.010193 -0.006876

In [210]:
returns['MSFT'].corr(returns['IBM'])

0.4870555245868012

In [211]:
returns['MSFT'].cov(returns['IBM'])

8.677868783556426e-05

In [212]:
returns.MSFT.corr(returns.IBM)

0.4870555245868012

In [213]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.379321  0.453246  0.460649
IBM   0.379321  1.000000  0.487056  0.403058
MSFT  0.453246  0.487056  1.000000  0.537822
GOOG  0.460649  0.403058  0.537822  1.000000

In [214]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000266  0.000076  0.000107  0.000116
IBM   0.000076  0.000152  0.000087  0.000077
MSFT  0.000107  0.000087  0.000209  0.000120
GOOG  0.000116  0.000077  0.000120  0.000239

利用 DataFrame 的 corrwith 方法，你可以计算其列或行跟另一个 Series 或 DataFrame 之间的相关系数。传入一个 Series 将会返回一个相关系数值 Series (针对各列进行计算):

In [215]:
returns.corrwith(returns.IBM)

AAPL    0.379321
IBM     1.000000
MSFT    0.487056
GOOG    0.403058
dtype: float64

In [216]:
returns.corrwith(volume)

AAPL   -0.062517
IBM    -0.156135
MSFT   -0.090362
GOOG   -0.020288
dtype: float64

In [217]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [218]:
uniques = obj.unique()

In [219]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [220]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [221]:
 pd.value_counts(obj.values, sort=False)

d    1
b    2
c    3
a    3
dtype: int64

In [222]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [223]:
mask = obj.isin(['b', 'c'])

In [224]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [225]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

与 isin 类似的是 Index.get_indexer 方法，它可以给你一个索引数组，从可能 包含重复值的数组到另一个不同值的数组:

In [226]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])

In [227]:
unique_vals = pd.Series(['c', 'b', 'a'])

In [228]:
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2])

In [229]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                     'Qu2': [2, 3, 1, 2, 3],
                     'Qu3': [1, 5, 2, 4, 4]})

In [230]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [231]:
result = data.apply(pd.value_counts).fillna(0)

In [232]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0